package com.javarush.task.task35.task3513;

//2048 (14)
//Случайный ход конечно неплох, но намного круче реализовать возможность умного хода.
// В дебри нейронных сетей мы заходить не будем, для начала сконцентрируемся на достаточно простой идее.
//
//Очевидно, хороший ход должен в итоге приближать нас к победе, а именно к получению плитки 2048.
//
//Предлагаю рассмотреть такой вариант сравнения эффективности хода:
//1. Первый ход является лучше второго, если после его совершения на поле находится больше пустых плиток,
// чем в результате второго хода.
//2. Первый ход является лучше второго, если общий счет после его совершения больше, чем счет
//полученный в результате второго хода.
//
//Для того, чтобы реализовать такое сравнение, мы можем совершить ход, оценить его эффективность и
// потом отменить совершенный ход, чтобы вернуть игру в начальное состояние.
// Применив эту последовательность действий ко всем четырем вариантам хода, сможем выбрать наиболее эффективный ход и выполнить его.
//
//Концептуально, нам понадобятся два класса, один будет описывать ход, а другой эффективность хода.
//
//Создай интерфейс Move с одним void методом move. Отметь интерфейс аннотацией @FunctionalInterface,
// которая будет сигнализировать о том что в этом интерфейсе будет только один абстрактный метод.
//
//Создай класс MoveEfficiency, описывающий эффективность хода. В нем нам понадобятся приватные поля
// numberOfEmptyTiles и score типа int, а также приватное поле поле move типа Move.
//В классе MoveEfficiency необходим конструктор с тремя параметрами (int numberOfEmptyTiles, int score, Move move)
// для инициализации полей класса и геттер для поля move.
//
//
//Требования:
//1. В интерфейсе Move должен присутствовать один абстрактный void метод move.
//2. Интерфейс Move должен быть отмечен аннотацией @FunctionalInterface.
//3. Конструктор класса MoveEfficiency должен корректно инициализировать поля класса.
//4. В классе MoveEfficiency должен быть создан корректный геттер для поля move.


//2048 (15)
//Для того, чтобы эффективности различных ходов можно было сравнивать, необходимо реализовать
// в классе MoveEfficiency поддержку интерфейса Comparable.
//
//В методе compareTo первым делом сравни количество пустых плиток (numberOfEmptyTiles),
// потом счет (score), если количество пустых плиток равное. Если и счет окажется равным,
// будем считать эффективность ходов равной и вернем ноль.
//
//Далее перейдем в класс Model и реализуем два метода:
//1) boolean hasBoardChanged - будет возвращать true, в случае, если вес плиток в массиве gameTiles
// отличается от веса плиток в верхнем массиве стека previousStates. Обрати внимание на то,
// что мы не должны удалять из стека верхний элемент, используй метод peek.
//2) MoveEfficiency getMoveEfficiency(Move move) - принимает один параметр типа move, и возвращает
// объект типа MoveEfficiency описывающий эффективность переданного хода. Несколько советов:
//а) не забудь вызывать метод rollback, чтобы восстановить корректное игровое состояние;
//б) в случае, если ход не меняет состояние игрового поля, количество пустых плиток и счет у объекта
// MoveEfficiency сделай равными -1 и 0 соответственно;
//в) выполнить ход можно вызвав метод move на объекте полученном в качестве параметра.
//
//
//Требования:
//1. Класс MoveEfficiency должен поддерживать интерфейс Comparable.
//2. Метод compareTo должен корректно сравнивать два объекта типа MoveEfficiency.
//3. Метод hasBoardChanged должен быть реализован в соответствии с условием задачи.
//4. Метод getMoveEfficiency должен возвращать эффективность хода полученного в качестве параметра.
//5. Если ход, переданный в метод getMoveEfficiency не меняет игровое поле, должен быть возвращен
// объект с количеством пустых клеток равным -1.
//6. Метод getMoveEfficiency не должен менять вес плиток в массиве gameTiles и счет.
public class MoveEfficiency implements Comparable<MoveEfficiency> {
  private int numberOfEmptyTiles;
  private int score;
  private Move move;

  public MoveEfficiency(int numberOfEmptyTiles, int score, Move move) {
    this.numberOfEmptyTiles = numberOfEmptyTiles;
    this.score = score;
    this.move = move;
  }

  public Move getMove() {
    return move;
  }

  @Override
  public int compareTo(MoveEfficiency o) {
    if (numberOfEmptyTiles > o.numberOfEmptyTiles) {
      return 1;
    } else if (numberOfEmptyTiles < o.numberOfEmptyTiles) {
      return -1;
    } else {
      if (score > o.score) {
        return 1;
      } else if (score < o.score) {
        return -1;
      }
    }
    return 0;
  }
}
